{
    "question_3723443764018800777": "FR: Do you understand the enterprise-wide risk appetite for your applications ?",
    "question_3723443764018800777_answer_0": "FR: You capture the risk appetite of your organization's executive leadership",
    "question_3723443764018800777_answer_1": "FR: The organization's leadership vet and approve the set of risks",
    "question_3723443764018800777_answer_2": "FR: You identify the main business and technical threats to your assets and data",
    "question_3723443764018800777_answer_3": "FR: You document risks and store them in an accessible location",
    "question_6697827520656393049": "FR: Do you use a set of metrics to measure the effectiveness and efficiency of the application security program across applications?",
    "question_6697827520656393049_answer_0": "FR: You document each metric, including a description of the sources, measurement coverage, and guidance on how to use it to explain application security trends",
    "question_6697827520656393049_answer_1": "FR: Metrics include measures of efforts, results, and the environment measurement categories",
    "question_6697827520656393049_answer_2": "FR: Most of the metrics are frequently measured, easy or inexpensive to gather, and expressed as a cardinal number or a percentage",
    "question_6697827520656393049_answer_3": "FR: Application security and development teams publish metrics",
    "question_2333017652923834639": "FR: Do you have a strategic plan for application security and use it to make decisions?",
    "question_2333017652923834639_answer_0": "FR: The plan reflects the organization's business priorities and risk appetite",
    "question_2333017652923834639_answer_1": "FR: The plan includes measurable milestones and a budget",
    "question_2333017652923834639_answer_2": "FR: The plan is consistent with the organization's business drivers and risks",
    "question_2333017652923834639_answer_3": "FR: The plan lays out a roadmap for strategic and tactical initiatives",
    "question_2333017652923834639_answer_4": "FR: You have buy-in from stakeholders, including development teams",
    "question_-5087311463412505196": "FR: Did you define Key Perfomance Indicators (KPI) from available application security metrics?",
    "question_-5087311463412505196_answer_0": "FR: You defined KPIs after gathering enough information to establish realistic objectives",
    "question_-5087311463412505196_answer_1": "FR: You developed KPIs with the buy-in from the leadership and teams responsible for application security",
    "question_-5087311463412505196_answer_2": "FR: KPIs are available to the application teams and include acceptability thresholds and guidance in case teams need to take action",
    "question_-5087311463412505196_answer_3": "FR: Success of the application security program is clearly visible based on defined KPIs",
    "question_-3473252142598392852": "FR: Do you regularly review and update the Strategic Plan for Application Security?",
    "question_-3473252142598392852_answer_0": "FR: You review and update the plan in response to significant changes in the business environment, the organization, or its risk appetite",
    "question_-3473252142598392852_answer_1": "FR: Plan update steps include reviewing the plan with all the stakeholders and updating the business drivers and strategies",
    "question_-3473252142598392852_answer_2": "FR: You adjust the plan and roadmap based on lessons learned from completed roadmap activities",
    "question_-3473252142598392852_answer_3": "FR: You publish progress information on roadmap activities, making sure they are available to all stakeholders",
    "question_-8930096911864596195": "FR: Do you update the Application Security strategy and roadmap based on application security metrics and KPIs?",
    "question_-8930096911864596195_answer_0": "FR: You review KPIs at least yearly for their efficiency and effectiveness",
    "question_-8930096911864596195_answer_1": "FR: KPIs and application security metrics trigger most of the changes to the application security strategy",
    "question_-1523424764746414731": "FR: Do you have and apply a common set of policies and standards throughout your organization?",
    "question_-1523424764746414731_answer_0": "FR: You have adapted existing standards appropriate for the organization\\u00e2\\u20ac\\u2122s industry to account for domain-specific considerations",
    "question_-1523424764746414731_answer_1": "FR: Your standards are aligned with your policies and incorporate technology-specific implementation guidance",
    "question_6045613465415965348": "FR: Do you have a complete picture of your external compliance obligations?",
    "question_6045613465415965348_answer_0": "FR: You have identified all sources of external compliance obligations",
    "question_6045613465415965348_answer_1": "FR: You have captured and reconciled compliance obligations from all sources",
    "question_4321363861471519433": "FR: Do you publish the organization's policies as test scripts or run-books for easy interpretation by development teams?",
    "question_4321363861471519433_answer_0": "FR: You create verification checklists and test scripts where applicable, aligned with the policy's requirements and the implementation guidance in the associated standards",
    "question_4321363861471519433_answer_1": "FR: You create versions adapted to each development methodology and technology the organization uses",
    "question_874730633439870778": "FR: Do you have a standard set of security requirements and verification procedures addressing the organization's external compliance obligations?",
    "question_874730633439870778_answer_0": "FR: You map each external compliance obligation to a well-defined set of application requirements",
    "question_874730633439870778_answer_1": "FR: You define verification procedures, including automated tests, to verify compliance with compliance-related requirements",
    "question_-5384665648483388584": "FR: Do you regularly report on policy and standard compliance, and use that information to guide compliance improvement efforts?",
    "question_-5384665648483388584_answer_0": "FR: You have procedures (automated, if possible) to regularly generate compliance reports",
    "question_-5384665648483388584_answer_1": "FR: You deliver compliance reports to all relevant stakeholders",
    "question_-5384665648483388584_answer_2": "FR: Stakeholders use the reported compliance status information to identify areas for improvement",
    "question_2504258487873968585": "FR: Do you regularly report on adherence to external compliance obligations and use that information to guide efforts to close compliance gaps?",
    "question_2504258487873968585_answer_0": "FR: You have established, well-defined compliance metrics",
    "question_2504258487873968585_answer_1": "FR: You measure and report on applications' compliance metrics regularly",
    "question_2504258487873968585_answer_2": "FR: Stakeholders use the reported compliance status information to identify compliance gaps and prioritize gap remediation efforts",
    "question_-3333436221574339254": "FR: Do you require employees involved with application development to take SDLC training?",
    "question_-3333436221574339254_answer_0": "FR: Training is repeatable, consistent, and available to anyone involved with software development lifecycle",
    "question_-3333436221574339254_answer_1": "FR: Training includes the latest OWASP Top 10 if appropriate and includes concepts such as Least Privilege, Defense-in-Depth, Fail Secure (Safe), Complete Mediation, Session Management, Open Design, and Psychological Acceptability",
    "question_-3333436221574339254_answer_2": "FR: Training requires a sign-off or an acknowledgement from attendees",
    "question_-3333436221574339254_answer_3": "FR: You have updated the training in the last 12 months",
    "question_-3333436221574339254_answer_4": "FR: Training is required during employees' onboarding process",
    "question_-1406737871072103554": "FR: Have you identified a Security Champion for each development team?",
    "question_-1406737871072103554_answer_0": "FR: Security Champions receive appropriate training",
    "question_-1406737871072103554_answer_1": "FR: Application Security and Development teams receive periodic briefings from Security Champions on the overall status of security initiatives and fixes",
    "question_-1406737871072103554_answer_2": "FR: The Security Champion reviews the results of external testing before adding to the application backlog",
    "question_-6726902685409359620": "FR: Is training customized for individual roles such as developers, testers, or security champions?",
    "question_-6726902685409359620_answer_0": "FR: Training includes all topics from maturity level 1, and adds more specific tools, techniques, and demonstrations",
    "question_-6726902685409359620_answer_1": "FR: Training is mandatory for all employees and contractors",
    "question_-6726902685409359620_answer_2": "FR: Training includes input from in-house SMEs and trainees",
    "question_-6726902685409359620_answer_3": "FR: Training includes demonstrations of tools and techniques developed in-house",
    "question_-6726902685409359620_answer_4": "FR: You use feedback to enhance and make future training more relevant",
    "question_1863458013960508497": "FR: Does the organization have a Secure Software Center of Excellence (SSCE)?",
    "question_1863458013960508497_answer_0": "FR: The SSCE has a charter defining its role in the organization",
    "question_1863458013960508497_answer_1": "FR: Development teams review all significant architectural changes with the SSCE",
    "question_1863458013960508497_answer_2": "FR: The SSCE publishes SDLC standards and guidelines related to Application Security",
    "question_1863458013960508497_answer_3": "FR: Product Champions are responsible for promoting the use of specific security tools",
    "question_-1011686183031253533": "FR: Have you implemented a Learning Management System or equivalent to track employee training and certification processes?",
    "question_-1011686183031253533_answer_0": "FR: A Learning Management System (LMS) is used to track trainings and certifications",
    "question_-1011686183031253533_answer_1": "FR: Training is based on internal standards, policies, and procedures",
    "question_-1011686183031253533_answer_2": "FR: You use certification programs or attendance records to determine access to development systems and resources",
    "question_-7665730842857957923": "FR: Is there a centralized portal where developers and application security professionals from different teams and business units are able to communicate and share information?",
    "question_-7665730842857957923_answer_0": "FR: The organization promotes use of a single portal across different teams and business units",
    "question_-7665730842857957923_answer_1": "FR: The portal is used for timely information such as notification of security incidents, tool updates, architectural standard changes, and other related announcements",
    "question_-7665730842857957923_answer_2": "FR: The portal is widely recognized by developers and architects as a centralized repository of the organization-specific application security information",
    "question_-7665730842857957923_answer_3": "FR: All content is considered persistent and searchable",
    "question_-7665730842857957923_answer_4": "FR: The portal provides access to application-specific security metrics",
    "question_-1674775488611705095": "FR: Do you classify applications according to business risk based on a simple and predefined set of questions?",
    "question_-1674775488611705095_answer_0": "FR: An agreed-upon risk classification exists",
    "question_-1674775488611705095_answer_1": "FR: The application team understands the risk classification",
    "question_-1674775488611705095_answer_2": "FR: The risk classification covers critical aspects of business risks the organization is facing",
    "question_-1674775488611705095_answer_3": "FR: The organization has an inventory for the applications in scope",
    "question_4463105369748799408": "FR: Do you identify and manage architectural design flaws with threat modeling?",
    "question_4463105369748799408_answer_0": "FR: You perform threat modeling for high-risk applications",
    "question_4463105369748799408_answer_1": "FR: You use simple threat checklists, such as STRIDE",
    "question_4463105369748799408_answer_2": "FR: You persist the outcome of a threat model for later use",
    "question_-3868068856305117979": "FR: Do you use centralized and quantified application risk profiles to evaluate business risk?",
    "question_-3868068856305117979_answer_0": "FR: The application risk profile is in line with the organizational risk standard",
    "question_-3868068856305117979_answer_1": "FR: The application risk profile covers impact to security and privacy",
    "question_-3868068856305117979_answer_2": "FR: You validate the quality of the risk profile manually and/or automatically",
    "question_-3868068856305117979_answer_3": "FR: The application risk profiles are stored in a central inventory",
    "question_-3603774300947986668": "FR: Do you use a standard methodology, aligned on your application risk levels?",
    "question_-3603774300947986668_answer_0": "FR: You train your architects, security champions, and other stakeholders on how to do practical threat modeling",
    "question_-3603774300947986668_answer_1": "FR: Your threat modeling methodology includes at least diagramming, threat identification, design flaw mitigations, and how to validate your threat model artifacts",
    "question_-3603774300947986668_answer_2": "FR: Changes in the application or business context trigger a review of the relevant threat models",
    "question_-3603774300947986668_answer_3": "FR: You capture the threat modeling artifacts with tools that are used by your application teams",
    "question_-2772309925619075254": "FR: Do you regularly review and update the risk profiles for your applications?",
    "question_-2772309925619075254_answer_0": "FR: The organizational risk standard considers historical feedback to improve the evaluation method",
    "question_-2772309925619075254_answer_1": "FR: Significant changes in the application or business context trigger a review of the relevant risk profiles",
    "question_-7872568402598233673": "FR: Do you regularly review and update the threat modeling methodology for your applications?",
    "question_-7872568402598233673_answer_0": "FR: The threat model methodology considers historical feedback for improvement",
    "question_-7872568402598233673_answer_1": "FR: You regularly (e.g., yearly) review the existing threat models to verify that no new threats are relevant for your applications",
    "question_-7872568402598233673_answer_2": "FR: You automate parts of your threat modeling process with threat modeling tools",
    "question_4890249461172665140": "FR: Do project teams specify security requirements during development?",
    "question_4890249461172665140_answer_0": "FR: Teams derive security requirements from functional requirements and customer or organization concerns",
    "question_4890249461172665140_answer_1": "FR: Security requirements are specific, measurable, and reasonable",
    "question_4890249461172665140_answer_2": "FR: Security requirements are in line with the organizational baseline",
    "question_6018840686303586200": "FR: Do stakeholders review vendor collaborations for security requirements and methodology?",
    "question_6018840686303586200_answer_0": "FR: You consider including specific security requirements, activities, and processes when creating third-party agreements",
    "question_6018840686303586200_answer_1": "FR: A vendor questionnaire is available and used to assess the strengths and weaknesses of your suppliers",
    "question_3507876255071903878": "FR: Do you define, structure, and include prioritization in the artifacts of the security requirements gathering process?",
    "question_3507876255071903878_answer_0": "FR: Security requirements take into consideration domain specific knowledge when applying policies and guidance to product development",
    "question_3507876255071903878_answer_1": "FR: Domain experts are involved in the requirements definition process",
    "question_3507876255071903878_answer_2": "FR: You have an agreed upon structured notation for security requirements",
    "question_3507876255071903878_answer_3": "FR: Development teams have a security champion dedicated to reviewing security requirements and outcomes",
    "question_746398359518218473": "FR: Do vendors meet the security responsibilities and quality measures of service level agreements defined by the organization?",
    "question_746398359518218473_answer_0": "FR: You discuss security requirements with the vendor when creating vendor agreements",
    "question_746398359518218473_answer_1": "FR: Vendor agreements provide specific guidance on security defect remediation within an agreed upon timeframe",
    "question_746398359518218473_answer_2": "FR: The organization has a templated agreement of responsibilities and service levels for key vendor security processes",
    "question_746398359518218473_answer_3": "FR: You measure key performance indicators",
    "question_-3825807989162916108": "FR: Do you use a standard requirements framework to streamline the elicitation of security requirements?",
    "question_-3825807989162916108_answer_0": "FR: A security requirements framework is available for project teams",
    "question_-3825807989162916108_answer_1": "FR: The framework is categorized by common requirements and standards-based requirements",
    "question_-3825807989162916108_answer_2": "FR: The framework gives clear guidance on the quality of requirements and how to describe them",
    "question_-3825807989162916108_answer_3": "FR: The framework is adaptable to specific business requirements",
    "question_4214909148748525416": "FR: Are vendors aligned with standard security controls and software development tools and processes that the organization utilizes?",
    "question_4214909148748525416_answer_0": "FR: The vendor has a secure SDLC that includes secure build, secure deployment, defect management, and incident management that align with those used in your organization",
    "question_4214909148748525416_answer_1": "FR: You verify the solution meets quality and security objectives before every major release",
    "question_4214909148748525416_answer_2": "FR: When standard verification processes are not available, you use compensating controls such as software composition analysis and independent penetration testing",
    "question_3262898178849243690": "FR: Do teams use security principles during design?",
    "question_3262898178849243690_answer_0": "FR: You have an agreed upon checklist of security principles",
    "question_3262898178849243690_answer_1": "FR: You store your checklist in an accessible location",
    "question_3262898178849243690_answer_2": "FR: Relevant stakeholders understand security principles",
    "question_-3393398358466125761": "FR: Do you evaluate the security quality of important technologies used for development?",
    "question_-3393398358466125761_answer_0": "FR: You have a list of the most important technologies used in or in support of each application",
    "question_-3393398358466125761_answer_1": "FR: You identify and track technological risks",
    "question_-3393398358466125761_answer_2": "FR: You ensure the risks to these technologies are in line with the organizational baseline",
    "question_3597873930793789960": "FR: Do you use shared security services during design?",
    "question_3597873930793789960_answer_0": "FR: You have a documented list of reusable security services, available to relevant stakeholders",
    "question_3597873930793789960_answer_1": "FR: You have reviewed the baseline security posture for each selected service",
    "question_3597873930793789960_answer_2": "FR: Your designers are trained to integrate each selected service following available guidance",
    "question_2354211419376989984": "FR: Do you have a list of recommended technologies for the organization?",
    "question_2354211419376989984_answer_0": "FR: The list is based on technologies used in the software portfolio",
    "question_2354211419376989984_answer_1": "FR: Lead architects and developers review and approve the list",
    "question_2354211419376989984_answer_2": "FR: You share the list across the organization",
    "question_2354211419376989984_answer_3": "FR: You review and update the list at least yearly",
    "question_4061129867983573157": "FR: Do you base your design on available reference architectures?",
    "question_4061129867983573157_answer_0": "FR: You have one or more approved reference architectures documented and available to stakeholders",
    "question_4061129867983573157_answer_1": "FR: You improve the reference architectures continuously based on insights and best practices",
    "question_4061129867983573157_answer_2": "FR: You provide a set of components, libraries, and tools to implement each reference architecture",
    "question_4971933665396615975": "FR: Do you enforce the use of recommended technologies within the organization?",
    "question_4971933665396615975_answer_0": "FR: You monitor applications regularly for the correct use of the recommended technologies",
    "question_4971933665396615975_answer_1": "FR: You solve violations against the list accoranding to organizational policies",
    "question_4971933665396615975_answer_2": "FR: You take action if the number of violations falls outside the yearly objectives",
    "question_5515757460982993557": "FR: Is your full build process formally described?",
    "question_5515757460982993557_answer_0": "FR: You have enough information to recreate the build processes",
    "question_5515757460982993557_answer_1": "FR: Your build documentation up to date",
    "question_5515757460982993557_answer_2": "FR: Your build documentation is stored in an accessible location",
    "question_5515757460982993557_answer_3": "FR: Produced artifact checksums are created during build to support later verification",
    "question_5515757460982993557_answer_4": "FR: You harden the tools that are used within the build process",
    "question_-2610767762091887881": "FR: Do you have solid knowledge about dependencies you're relying on?",
    "question_-2610767762091887881_answer_0": "FR: You have a current bill of materials (BOM) for every application",
    "question_-2610767762091887881_answer_1": "FR: You can quickly find out which applications are affected by a particular CVE",
    "question_-2610767762091887881_answer_2": "FR: You have analyzed, addressed, and documented findings from dependencies at least once in the last three months",
    "question_-6716113646648932623": "FR: Is the build process fully automated?",
    "question_-6716113646648932623_answer_0": "FR: The build process itself doesn't require any human interaction",
    "question_-6716113646648932623_answer_1": "FR: Your build tools are hardened as per best practice and vendor guidance",
    "question_-6716113646648932623_answer_2": "FR: You encrypt the secrets required by the build tools and control access based on the principle of least privilege",
    "question_-7381900718490210696": "FR: Do you handle 3rd party dependency risk by a formal process?",
    "question_-7381900718490210696_answer_0": "FR: You keep a list of approved dependencies that meet predefined criteria",
    "question_-7381900718490210696_answer_1": "FR: You automatically evaluate dependencies for new CVEs and alert responsible staff",
    "question_-7381900718490210696_answer_2": "FR: You automatically detect and alert to license changes with possible impact on legal application usage",
    "question_-7381900718490210696_answer_3": "FR: You track and alert to usage of unmaintained dependencies",
    "question_-7381900718490210696_answer_4": "FR: You reliably detect and remove unnecessary dependencies from the software",
    "question_2334200486460052581": "FR: Do you enforce automated security checks in your build processes?",
    "question_2334200486460052581_answer_0": "FR: Builds fail if the application doesn't meet a predefined security baseline",
    "question_2334200486460052581_answer_1": "FR: You have a maximum accepted severity for vulnerabilties",
    "question_2334200486460052581_answer_2": "FR: You log warnings and failures in a centralized system",
    "question_2334200486460052581_answer_3": "FR: You select and configure tools to evaluate each application against its security requirements at least once a year",
    "question_2432840712871259512": "FR: Do you prevent build of software if it's affected by vulnerabilities in dependencies?",
    "question_2432840712871259512_answer_0": "FR: Your build system is connected to a system for tracking 3rd party dependency risk, causing build to fail unless the vulnerability is evaluated to be a false positive or the risk is explicitly accepted",
    "question_2432840712871259512_answer_1": "FR: You scan your dependencies using a static analysis tool",
    "question_2432840712871259512_answer_2": "FR: You report findings back to dependency authors using an established responsible disclosure process",
    "question_2432840712871259512_answer_3": "FR: Using a new dependency not evaluated for security risks causes the build to fail",
    "question_-7040227407222181198": "FR: Do you use repeatable deployment processes?",
    "question_-7040227407222181198_answer_0": "FR: You have enough information to run the deployment processes",
    "question_-7040227407222181198_answer_1": "FR: Your deployment documentation up to date",
    "question_-7040227407222181198_answer_2": "FR: Your deployment documentation is accessible to relevant stakeholders",
    "question_-7040227407222181198_answer_3": "FR: You ensure that only defined qualified personnel can trigger a deployment",
    "question_-7040227407222181198_answer_4": "FR: You harden the tools that are used within the deployment process",
    "question_-3758007768105556425": "FR: Do you limit access to application secrets according to the least privilege principle?",
    "question_-3758007768105556425_answer_0": "FR: You store production secrets protected in a secured location",
    "question_-3758007768105556425_answer_1": "FR: Developers do not have access to production secrets",
    "question_-3758007768105556425_answer_2": "FR: Production secrets are not available in non-production environments",
    "question_-4337844381075647154": "FR: Are deployment processes automated and employing security checks?",
    "question_-4337844381075647154_answer_0": "FR: Deployment processes are automated on all stages",
    "question_-4337844381075647154_answer_1": "FR: Deployment includes automated security testing procedures",
    "question_-4337844381075647154_answer_2": "FR: You alert responsible staff to identified vulnerabilities",
    "question_-4337844381075647154_answer_3": "FR: You have logs available for your past deployments for a defined period of time",
    "question_2202819877926779046": "FR: Do you inject production secrets into configuration files during deployment?",
    "question_2202819877926779046_answer_0": "FR: Source code files no longer contain active application secrets",
    "question_2202819877926779046_answer_1": "FR: Under normal circumstances, no humans access secrets during deployment procedures",
    "question_2202819877926779046_answer_2": "FR: You log and alert to any abnormal access to secrets",
    "question_651286685926206337": "FR: Do you consistently validate the integrity of deployed artifacts?",
    "question_651286685926206337_answer_0": "FR: You prevent or roll back deployment if you detect an integrity breach",
    "question_651286685926206337_answer_1": "FR: The verification is done against signatures created during the build time",
    "question_651286685926206337_answer_2": "FR: If checking of signatures is not possible (e.g. externally build software), you introduce compensating measures",
    "question_-3088993605522152049": "FR: Do you practice proper lifecycle management for application secrets?",
    "question_-3088993605522152049_answer_0": "FR: You generate and synchronize secrets using a vetted solution",
    "question_-3088993605522152049_answer_1": "FR: Secrets are different between different application instances",
    "question_-3088993605522152049_answer_2": "FR: Secrets are regularly updated",
    "question_255515089467447967": "FR: Do you track all known security defects in accessible locations?",
    "question_255515089467447967_answer_0": "FR: You can easily get an overview of all security defects impacting one application",
    "question_255515089467447967_answer_1": "FR: You have at least a rudimentary classification scheme in place",
    "question_255515089467447967_answer_2": "FR: The process includes a strategy for handling false positives and duplicate entries",
    "question_255515089467447967_answer_3": "FR: The defect management system covers defects from various sources and activities",
    "question_-123897944544734953": "FR: Do you use basic metrics about recorded security defects to carry out quick win improvement activities?",
    "question_-123897944544734953_answer_0": "FR: You analyzed your recorded metrics at least once in the last year",
    "question_-123897944544734953_answer_1": "FR: At least basic information about this initiative is recorded and available",
    "question_-123897944544734953_answer_2": "FR: You have identified and carried out at least one quick win activity based on the data",
    "question_-7498351440478268461": "FR: Do you keep an overview of the state of security defects across the organization?",
    "question_-7498351440478268461_answer_0": "FR: A single severity scheme is applied to all defects across the organization",
    "question_-7498351440478268461_answer_1": "FR: The scheme includes SLAs for fixing particular severity classes",
    "question_-7498351440478268461_answer_2": "FR: You regularly report compliance to SLAs",
    "question_-4769071673904521120": "FR: Do you improve your security assurance program upon standardized metrics?",
    "question_-4769071673904521120_answer_0": "FR: You document metrics for defect classification and categorization and keep them up to date",
    "question_-4769071673904521120_answer_1": "FR: Executive management regularly receives information about defects and has acted upon it in the last year",
    "question_-4769071673904521120_answer_2": "FR: You regularly share technical details about security defects among teams",
    "question_741095327169331743": "FR: Do you enforce SLAs for fixing security defects?",
    "question_741095327169331743_answer_0": "FR: You automatically alert of SLA breaches and transfer respective defects to the risk management process",
    "question_741095327169331743_answer_1": "FR: You integrate relevant tooling (e.g. monitoring, build, deployment) with the defect management system",
    "question_-7000191822899618298": "FR: Do you regularly evaluate the effectiveness of your security metrics so that its input helps drive your security strategy?",
    "question_-7000191822899618298_answer_0": "FR: You have analyzed the effectivenss of the security metrics at least once in the last year",
    "question_-7000191822899618298_answer_1": "FR: Where possible, you verify the correctness of the data automatically",
    "question_-7000191822899618298_answer_2": "FR: The metrics is aggregated with other sources like threat intelligence or incident management",
    "question_-7000191822899618298_answer_3": "FR: You derived at least one strategic activity from the metrics in the last year",
    "question_884241122542632784": "FR: Do you review the application architecture for key security objectives on an ad-hoc basis?",
    "question_884241122542632784_answer_0": "FR: You have an agreed upon model of the overall software architecture",
    "question_884241122542632784_answer_1": "FR: You include components, interfaces, and integrations in the architecture model",
    "question_884241122542632784_answer_2": "FR: You verify the correct provision of general security mechanisms",
    "question_884241122542632784_answer_3": "FR: You log missing security controls as defects",
    "question_8339929635739724821": "FR: Do you review the application architecture for mitigations of typical threats on an ad-hoc basis?",
    "question_8339929635739724821_answer_0": "FR: You have an agreed upon model of the overall software architecture",
    "question_8339929635739724821_answer_1": "FR: Security savvy staff conduct the review",
    "question_8339929635739724821_answer_2": "FR: You consider different types of threats, including insider and data-related one",
    "question_6174270796302674891": "FR: Do you regularly review the security mechanisms of your architecture?",
    "question_6174270796302674891_answer_0": "FR: You review compliance with internal and external requirements",
    "question_6174270796302674891_answer_1": "FR: You systematically review each interface in the system",
    "question_6174270796302674891_answer_2": "FR: You use a formalized review method and structured validation",
    "question_6174270796302674891_answer_3": "FR: You log missing security mechanisms as defects",
    "question_-233996144629998332": "FR: Do you regularly evaluate the threats to your architecture?",
    "question_-233996144629998332_answer_0": "FR: You systematically review each threat identified in the Threat Assessment",
    "question_-233996144629998332_answer_1": "FR: Trained or experienced people lead review exercise",
    "question_-233996144629998332_answer_2": "FR: You identify mitigating design-level features for each identified threat",
    "question_-233996144629998332_answer_3": "FR: You log unhandled threats as defects",
    "question_-3344061069458032857": "FR: Do you regularly review the effectiveness of the security controls?",
    "question_-3344061069458032857_answer_0": "FR: You evaluate the preventive, detective, and response capabilities of security controls",
    "question_-3344061069458032857_answer_1": "FR: You evaluate the strategy alignment, appropriate support, and scalability of security controls",
    "question_-3344061069458032857_answer_2": "FR: You evaluate the effectiveness at least yearly",
    "question_-3344061069458032857_answer_3": "FR: You log identified shortcomings as defects",
    "question_207136565323997405": "FR: Do you regularly update your reference architectures based on architecture assessment findings?",
    "question_207136565323997405_answer_0": "FR: You assess your architectures in a standardized, documented manner",
    "question_207136565323997405_answer_1": "FR: You use recurring findings to trigger a review of reference architectures",
    "question_207136565323997405_answer_2": "FR: You independently review the quality of the architecture assessments on an ad-hoc basis",
    "question_207136565323997405_answer_3": "FR: You use reference architecture updates to trigger reviews of relevant shared solutions, in a risk-based manner",
    "question_8848809830710095914": "FR: Do you test applications for the correct functioning of standard security controls?",
    "question_8848809830710095914_answer_0": "FR: Security testing at least verifies the implementation of authentication, access control, input validation, encoding and escaping data, and encryption controls",
    "question_8848809830710095914_answer_1": "FR: Security testing executes whenever the application changes its use of the controls",
    "question_7155804185791503697": "FR: Do you test applications using randomization or fuzzing techniques?",
    "question_7155804185791503697_answer_0": "FR: Testing covers most or all of the application's main input parameters",
    "question_7155804185791503697_answer_1": "FR: You record and inspect all application crashes for security impact on a best-effort basis",
    "question_-6599087861391944615": "FR: Do you consistently write and execute test scripts to verify the functionality of security requirements?",
    "question_-6599087861391944615_answer_0": "FR: You tailor tests to each application and assert expected security functionality",
    "question_-6599087861391944615_answer_1": "FR: You capture test results as a pass or fail condition",
    "question_-6599087861391944615_answer_2": "FR: Tests use a standardized framework or DSL",
    "question_455698695473591001": "FR: Do you create abuse cases from functional requirements and use them to drive security tests?",
    "question_455698695473591001_answer_0": "FR: Important business functionality has corresponding abuse cases",
    "question_455698695473591001_answer_1": "FR: You build abuse stories around relevant personas with well-defined motivations and characteristics",
    "question_455698695473591001_answer_2": "FR: You capture identified weaknesses as security requirements",
    "question_-1364552990706175591": "FR: Do you automatically test applications for security regressions?",
    "question_-1364552990706175591_answer_0": "FR: You consistently write tests for all identified bugs (possibly exceeding a pre-defined severity threshhold)",
    "question_-1364552990706175591_answer_1": "FR: You collect security tests in a test suite that is part of the existing unit testing framework",
    "question_-7242123601190715501": "FR: Do you perform denial of service and security stress testing?",
    "question_-7242123601190715501_answer_0": "FR: Stress tests target specific application resources (e.g. memory exhaustion by saving large amounts of data to a user session)",
    "question_-7242123601190715501_answer_1": "FR: You design tests around relevant personas with well-defined capabilities (knowledge, resources)",
    "question_-7242123601190715501_answer_2": "FR: You feed the results back to the Design practices",
    "question_-7100952117724958119": "FR: Do you scan applications with automated security testing tools?",
    "question_-7100952117724958119_answer_0": "FR: You dynamically generate inputs for security tests using automated tools",
    "question_-7100952117724958119_answer_1": "FR: You choose the security testing tools to fit the organization's architecture and technology stack, and balance depth and accuracy of inspection with usability of findings to the organization",
    "question_4740152266433469453": "FR: Do you manually review the security quality of selected high-risk components?",
    "question_4740152266433469453_answer_0": "FR: Criteria exist to help the reviewer focus on high-risk components",
    "question_4740152266433469453_answer_1": "FR: Qualified personnel conduct reviews following documented guidelines",
    "question_4740152266433469453_answer_2": "FR: You address findings in accordance with the organization's defect management policy",
    "question_-5323825785841584848": "FR: Do you customize the automated security tools to your applications and technology stacks?",
    "question_-5323825785841584848_answer_0": "FR: You tune and select tool features which match your application or technology stack",
    "question_-5323825785841584848_answer_1": "FR: You minimize false positives by silencing or automatically filter irrelevant warnings or low probability findings",
    "question_-5323825785841584848_answer_2": "FR: You minimize false negatives by leverage tool extensions or DSLs to customize tools for your application or organizational standards",
    "question_4021197393569420521": "FR: Do you perform penetration testing for your applications at regular intervals?",
    "question_4021197393569420521_answer_0": "FR: Penetration testing uses application-specific security test cases to evaluate security",
    "question_4021197393569420521_answer_1": "FR: Penetration testing looks for both technical and logical issues in the application",
    "question_4021197393569420521_answer_2": "FR: Stakeholders review the test results and handle them in accordance with the organization's risk management",
    "question_4021197393569420521_answer_3": "FR: Qualified personnnel performs penetration testing",
    "question_4674960647406794832": "FR: Do you integrate automated security testing into the build and deploy process?",
    "question_4674960647406794832_answer_0": "FR: Management and business stakeholders track and review test results throughout the development cycle",
    "question_4674960647406794832_answer_1": "FR: You merge test results into a central dashboard and feed them into defect management",
    "question_4588225785708880552": "FR: Do you use the results of security testing to improve the development lifecycle?",
    "question_4588225785708880552_answer_0": "FR: You use results from other security activities to improve integrated security testing during development",
    "question_4588225785708880552_answer_1": "FR: You review test results and incorporate them into security awareness training and security testing playbooks",
    "question_4588225785708880552_answer_2": "FR: Stakeholders review the test results and handle them in accordance with the organization's risk management",
    "question_-8463639202655823504": "FR: Do you analyze log data for security incidents periodically?",
    "question_-8463639202655823504_answer_0": "FR: You have a contact point for the creation of security incidents",
    "question_-8463639202655823504_answer_1": "FR: You analyze data in accordance with the log data retention periods",
    "question_-8463639202655823504_answer_2": "FR: The frequency of this analysis is aligned with the criticality of your applications",
    "question_653530517721014202": "FR: Do you respond to detected incidents?",
    "question_653530517721014202_answer_0": "FR: You have a defined person or role for incident handling",
    "question_653530517721014202_answer_1": "FR: You document security incidents",
    "question_8016069030958078308": "FR: Do you follow a documented process for incident detection?",
    "question_8016069030958078308_answer_0": "FR: The process has a dedicated owner",
    "question_8016069030958078308_answer_1": "FR: You store process documentation in an accessible location",
    "question_8016069030958078308_answer_2": "FR: The process considers an escalation path for further analysis",
    "question_8016069030958078308_answer_3": "FR: You train employees responsible for incident detection in this process",
    "question_8016069030958078308_answer_4": "FR: You have a checklist of potential attacks to simplify incident detection",
    "question_-7602900934506710646": "FR: Do you use a repeatable process for incident handling?",
    "question_-7602900934506710646_answer_0": "FR: You have an agreed upon incident classification",
    "question_-7602900934506710646_answer_1": "FR: The process considers Root Case Analysis for high severity incidents",
    "question_-7602900934506710646_answer_2": "FR: Employees responsible for incident response are trained in this process",
    "question_-7602900934506710646_answer_3": "FR: Forensic analysis tooling is available",
    "question_3227856319105655641": "FR: Do you review and update the incident detection process regularly?",
    "question_3227856319105655641_answer_0": "FR: You perform reviews at least annually",
    "question_3227856319105655641_answer_1": "FR: You update the checklist of potential attacks with external and internal data",
    "question_3372869350770201666": "FR: Do you have a dedicated incident response team available?",
    "question_3372869350770201666_answer_0": "FR: The team performs Root Cause Analysis for all security incidents unless there is a specific reason not to do so",
    "question_3372869350770201666_answer_1": "FR: You review and update the response process at least annually",
    "question_-7476084007192951810": "FR: Do you harden configurations for key components of your technology stacks?",
    "question_-7476084007192951810_answer_0": "FR: You have identified the key components in each technology stack used",
    "question_-7476084007192951810_answer_1": "FR: You have an established configuration standard for each key component",
    "question_2740949561220473905": "FR: Do you identify and patch vulnerable components?",
    "question_2740949561220473905_answer_0": "FR: You have an up-to-date list of components, including version information",
    "question_2740949561220473905_answer_1": "FR: You regularly review public sources for vulnerabilities related to your components",
    "question_5204064549809084889": "FR: Do you have hardening baselines for your components?",
    "question_5204064549809084889_answer_0": "FR: You have assigned an owner for each baseline",
    "question_5204064549809084889_answer_1": "FR: The owner keeps their assigned baselines up to date",
    "question_5204064549809084889_answer_2": "FR: You store baselines in an accessible location",
    "question_5204064549809084889_answer_3": "FR: You train employees responsible for configurations in these baselines",
    "question_2693667223134869245": "FR: Do you follow an established process for updating components of your technology stacks?",
    "question_2693667223134869245_answer_0": "FR: The process includes vendor information for third-party patches",
    "question_2693667223134869245_answer_1": "FR: The process considers external sources to gather information about zero day attacks, and includes appropriate risk mitigation steps",
    "question_2693667223134869245_answer_2": "FR: The process includes guidance for prioritizing component updates",
    "question_4124449162772906706": "FR: Do you monitor and enforce conformity with hardening baselines?",
    "question_4124449162772906706_answer_0": "FR: You perform conformity checks regularly, preferably using automation",
    "question_4124449162772906706_answer_1": "FR: You store conformity check results in an accessible location",
    "question_4124449162772906706_answer_2": "FR: You follow an established process to address reported non-conformities",
    "question_4124449162772906706_answer_3": "FR: You review each baseline at least annually, and update it when required",
    "question_-3865133261829353850": "FR: Do you regularly evaluate components and review patch level status?",
    "question_-3865133261829353850_answer_0": "FR: You update the list with components and versions",
    "question_-3865133261829353850_answer_1": "FR: You identify and update missing updates according to existing SLA",
    "question_-3865133261829353850_answer_2": "FR: You review and update the process based on feedback from the people who perform patching",
    "question_6711038967366759999": "FR: Do you protect and handle information according to protection requirements for data stored and processed on each application?",
    "question_6711038967366759999_answer_0": "FR: You know the data elements processed and stored by each application",
    "question_6711038967366759999_answer_1": "FR: You know the type and sensitivity level of each identified data element",
    "question_6711038967366759999_answer_2": "FR: You have controls to prevent propagation of unsanitized sensitive data from production to lower environments",
    "question_-5536395266287267543": "FR: Do you identify and remove systems, applications, application dependencies, or services that are no longer used, have reached end of life, or are no longer actively developed or supported?",
    "question_-5536395266287267543_answer_0": "FR: You do not use unsupported applications or dependencies",
    "question_-5536395266287267543_answer_1": "FR: You manage customer/user migration from older versions for each product and customer/user group",
    "question_8580442960506868112": "FR: Do you maintain a data catalog, including types, sensitivity levels, and processing and storage locations?",
    "question_8580442960506868112_answer_0": "FR: The data catalog is stored in an accessible location",
    "question_8580442960506868112_answer_1": "FR: You know which data elements are subject to specific regulation",
    "question_8580442960506868112_answer_2": "FR: You have controls for protecting and preserving data throughout its lifetime",
    "question_8580442960506868112_answer_3": "FR: You have retention requirements for data, and you destroy backups in a timely manner after the relevant retention period ends",
    "question_-8635987629819838735": "FR: Do you follow an established process for removing all associated resources, as part of decommissioning of unused systems, applications, application dependencies, or services?",
    "question_-8635987629819838735_answer_0": "FR: You document the status of support for all released versions of your products, in an accessible location",
    "question_-8635987629819838735_answer_1": "FR: The process includes replacement or upgrade of third-party applications, or application dependencies, that have reached end of life",
    "question_-8635987629819838735_answer_2": "FR: Operating environments do not contain orphaned accounts, firewall rules, or other configuration artifacts",
    "question_792796231736178614": "FR: Do you regularly review and update the data catalog and your data protection policies and procedures?",
    "question_792796231736178614_answer_0": "FR: You have automated monitoring to detect attempted or actual violations of the Data Protection Policy",
    "question_792796231736178614_answer_1": "FR: You have tools for data loss prevention, access control and tracking, or anomalous behavior detection",
    "question_792796231736178614_answer_2": "FR: You periodically audit the operation of automated mechanisms, including backups and record deletions",
    "question_9069879412548517933": "FR: Do you regularly evaluate the lifecycle state and support status of every software asset and underlying infrastructure component, and estimate their end of life?",
    "question_9069879412548517933_answer_0": "FR: Your end of life management process is agreed upon",
    "question_9069879412548517933_answer_1": "FR: You inform customers and user groups of product timelines to prevent disruption of service or support",
    "question_9069879412548517933_answer_2": "FR: You review the process at least annually"
}